# CurrentUserAddinsLocation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..CurrentUserAddinsLocation Property
ControlledApplication Class See Also
---
The folder location for .addin files for the current user.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string CurrentUserAddinsLocation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentUserAddinsLocation As String
	Get
```

Visual C++
---
```text
public:
property String^ CurrentUserAddinsLocation {
	String^ get ();
}
```

# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace